WARNING:tensorflow:Error in loading the saved optimizer state. As a result, your model is starting with a freshly initialized optimizer.
Model: "sequential"
_________________________________________________________________
 Layer (type)                Output Shape              Param #
=================================================================
 embedding (Embedding)       (None, None, 64)          1280064

 dropout (Dropout)           (None, None, 64)          0

 gru (GRU)                   (None, 8)                 1776

 dropout_1 (Dropout)         (None, 8)                 0

 dense (Dense)               (None, 1)                 9

=================================================================
Total params: 1,281,849
Trainable params: 1,281,849
Non-trainable params: 0
_________________________________________________________________
23/23 [==============================] - 2s 4ms/step - loss: 0.3410 - binary_accuracy: 0.8859

Process finished with exit code 0
