WARNING:tensorflow:Error in loading the saved optimizer state. As a result, your model is starting with a freshly initialized optimizer.
Model: "sequential"
_________________________________________________________________
 Layer (type)                Output Shape              Param #
=================================================================
 embedding (Embedding)       (None, None, 64)          1280064

 dropout (Dropout)           (None, None, 64)          0

 gru (GRU)                   (None, 6)                 1296

 dropout_1 (Dropout)         (None, 6)                 0

 dense (Dense)               (None, 1)                 7

=================================================================
Total params: 1,281,367
Trainable params: 1,281,367
Non-trainable params: 0
_________________________________________________________________
23/23 [==============================] - 1s 5ms/step - loss: 0.3088 - binary_accuracy: 0.9056